readme.org
#+TITLE: Emacs Configuration
#+AUTHOR: Alfred Roos
#+PROPERTY: header-args:emacs-lisp :mkdirp yes
#+STARTUP: overview

* Table of Contents :TOC:
- [[#introduction][Introduction]]
- [[#installation][Installation]]
  - [[#auto-tangle-on-save][Auto-tangle on save]]
- [[#main-configuration-initel][Main Configuration (init.el)]]
- [[#package-management-lisppackagesel][Package Management (lisp/packages.el)]]
  - [[#package-setup][Package Setup]]
  - [[#version-control][Version Control]]
  - [[#completion-framework][Completion Framework]]
  - [[#project-management--navigation][Project Management & Navigation]]
  - [[#web-development][Web Development]]
  - [[#lsp--java-development][LSP & Java Development]]
  - [[#theme--visual][Theme & Visual]]
  - [[#editing-enhancements][Editing Enhancements]]
  - [[#javascripttypescript][JavaScript/TypeScript]]
  - [[#syntax-highlighting--editing][Syntax Highlighting & Editing]]
  - [[#file-management][File Management]]
  - [[#productivity--utilities][Productivity & Utilities]]
  - [[#window-management][Window Management]]
  - [[#enhanced-completion-ui][Enhanced Completion UI]]
  - [[#additional-utilities][Additional Utilities]]
- [[#keybindings-lispkeybindingsel][Keybindings (lisp/keybindings.el)]]
  - [[#project--navigation][Project & Navigation]]
  - [[#code-folding][Code Folding]]
  - [[#multiple-cursors][Multiple Cursors]]
  - [[#buffer-management][Buffer Management]]
  - [[#compilation][Compilation]]
  - [[#window-management-1][Window Management]]
  - [[#lsp][LSP]]
  - [[#dired][Dired]]
- [[#ui-configuration-lispuiel][UI Configuration (lisp/ui.el)]]
  - [[#basic-ui-settings][Basic UI Settings]]
  - [[#line-numbers--highlighting][Line Numbers & Highlighting]]
  - [[#indentation][Indentation]]
  - [[#yesno-prompts][Yes/No Prompts]]
  - [[#auto-save-configuration][Auto-save Configuration]]
  - [[#cursor-configuration][Cursor Configuration]]
  - [[#editing-modes][Editing Modes]]
  - [[#web-mode-settings][Web Mode Settings]]
  - [[#theme][Theme]]
  - [[#dired-settings][Dired Settings]]
  - [[#dashboard][Dashboard]]
  - [[#custom-functions][Custom Functions]]
- [[#tree-sitter-lisptreesitterel][Tree-sitter (lisp/treesitter.el)]]
- [[#notes][Notes]]

* Introduction

This is my literate Emacs configuration using Org mode. The configuration is organized into separate files for better modularity.

To use this configuration:
1. Clone or copy this =README.org= to your =~/.config/emacs/= directory
2. Run =M-x org-babel-tangle= or save this file to generate all config files
3. Restart Emacs
  
* Installation

** Auto-tangle on save

Add this to your existing init.el to auto-tangle this file on save:

#+begin_src emacs-lisp :tangle no
(defun my/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "README.org" user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle)
      (message "Configuration tangled!"))))

(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
#+end_src

* Main Configuration (init.el)

The main entry point that loads all other configuration modules.

#+begin_src emacs-lisp :tangle ~/.config/emacs/init.el
;; Load custom Emacs Lisp files
(add-to-list 'load-path "/home/spy/.config/emacs/lisp")
(setq browse-url-browser-function 'browse-url-firefox)

;; Java Configuration
(setenv "JAVA_HOME" "/usr/lib/jvm/java-25-openjdk")
(setq exec-path (cons (concat (getenv "JAVA_HOME") "/bin") exec-path))

;; Disable auto-save files
(setq auto-save-default nil
      auto-save-list-file-prefix nil)

;; Disable backup files
(setq make-backup-files nil)

;; Disable lockfiles
(setq create-lockfiles nil)

;; Disable desktop save
(setq desktop-save nil)

;; LSP performance optimization
(setq gc-cons-threshold 100000000) ;; 100 MB

;; Load configuration modules
(load "packages")
(load "ui")
(load "keybindings")
(load "treesitter")
(load "secret")

;; Custom file configuration
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

* Package Management (lisp/packages.el)

All package declarations and configurations.

** Package Setup

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(require 'package)

;; Add package archives
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("gnu"   . "https://elpa.gnu.org/packages/")
        ("org"   . "https://orgmode.org/elpa/")))

;; Initialize the package system
(package-initialize)

;; Refresh package contents if needed
(unless package-archive-contents
  (package-refresh-contents))

;; Install use-package if not already installed
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** Version Control

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package magit
  :ensure t
  :defer t
  :bind (("C-x g" . magit-status)))
#+end_src

** Completion Framework

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.5))

;; Enable Vertico
(use-package vertico
  :init
  (vertico-mode 1))

(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts
(use-package savehist
  :init
  (savehist-mode 1))

;; Emacs minibuffer configurations
(setq enable-recursive-minibuffers t
      read-extended-command-predicate #'command-completion-default-include-p
      minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))

;; Optional: Enable context menu mode
(context-menu-mode 1)

(use-package consult
  :bind (("C-s" . consult-line)
         ("C-x b" . consult-buffer)
         ("M-y" . consult-yank-pop)))

(use-package embark
  :bind (("M-o" . embark-act)
         ("C-h B" . embark-bindings))
  :init (setq prefix-help-command #'embark-prefix-help-command))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package embark-consult
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Project Management & Navigation

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package treemacs)
(use-package fold-this)
(use-package projectile)
#+end_src

** Web Development

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package web-mode
  :ensure t
  :mode
  (("\\.phtml\\'" . web-mode)
   ("\\.php\\'" . web-mode)
   ("\\.ts\\'" . web-mode)
   ("\\.tsx\\'" . web-mode)
   ("\\.tpl\\'" . web-mode)
   ("\\.[agj]sp\\'" . web-mode)
   ("\\.as[cp]x\\'" . web-mode)
   ("\\.erb\\'" . web-mode)
   ("\\.mustache\\'" . web-mode)
   ("\\.djhtml\\'" . web-mode)))
#+end_src

** LSP & Java Development

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
  (use-package lsp-mode
    :hook ((java-mode . lsp))
    :commands lsp
    :config
    (setq lsp-prefer-flymake nil   ;; Use flycheck instead of flymake
          lsp-enable-snippet t
          lsp-completion-provider :capf))

  (use-package lsp-ui
    :commands lsp-ui-mode
    :config
    (setq lsp-ui-doc-enable t
          lsp-ui-sideline-enable t
          lsp-ui-sideline-show-code-actions t))

  (use-package lsp-treemacs
    :after lsp)

  (use-package company
    :hook ((java-mode . company-mode))
    :config
    (setq company-minimum-prefix-length 1
          company-idle-delay 0.0))

  (use-package dap-mode
    :after lsp-mode
    :config
    (dap-auto-configure-mode)
    ;; Enable java debugging support
    (require 'dap-java))

  ;; LSP Java
  (use-package lsp-java
    :after lsp
    :config
    (add-hook 'java-mode-hook #'lsp)
    ;; Optional: auto import
    (setq lsp-java-format-settings-url "https://raw.githubusercontent.com/google/styleguide/gh-pages/eclipse-java-google-style.xml"
          lsp-java-format-settings-profile "GoogleStyle"))

  (use-package java-snippets)
#+end_src

** Theme & Visual

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package all-the-icons :if (display-graphic-p))

(use-package doom-themes
  :init
  (load-theme 'doom-one t))

(use-package doom-modeline
  :init
  (doom-modeline-mode 1)
  :custom
  ;; Optional tweaks
  (doom-modeline-height 25)
  (doom-modeline-bar-width 3)
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-minor-modes nil)
  (doom-modeline-indent-info t)
  (doom-modeline-icon t))  ;; requires all-the-icons package
#+end_src

** Editing Enhancements

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package multiple-cursors)

(use-package eyebrowse)
(eyebrowse-mode)
#+end_src

