lisp/packages.el
(require 'package)

;; Add package archives
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("gnu"   . "https://elpa.gnu.org/packages/")
        ("org"   . "https://orgmode.org/elpa/")))

;; Initialize the package system
(package-initialize)

;; Refresh package contents if needed
(unless package-archive-contents
  (package-refresh-contents))

;; Install use-package if not already installed
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package magit
  :ensure t
  :defer t
  :bind (("C-x g" . magit-status)))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.5))

;; Enable Vertico
(use-package vertico
  :init
  (vertico-mode 1))

(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts
(use-package savehist
  :init
  (savehist-mode 1))

;; Emacs minibuffer configurations
(setq enable-recursive-minibuffers t
      read-extended-command-predicate #'command-completion-default-include-p
      minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))

;; Optional: Enable context menu mode
(context-menu-mode 1)

(use-package consult
  :bind (("C-s" . consult-line)
         ("C-x b" . consult-buffer)
         ("M-y" . consult-yank-pop)))

(use-package embark
  :bind (("M-o" . embark-act)
         ("C-h B" . embark-bindings))
  :init (setq prefix-help-command #'embark-prefix-help-command))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

(use-package embark-consult
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))

(use-package treemacs)
(use-package fold-this)
(use-package projectile)

(use-package web-mode
  :ensure t
  :mode
  (("\\.phtml\\'" . web-mode)
   ("\\.php\\'" . web-mode)
   ("\\.ts\\'" . web-mode)
   ("\\.tsx\\'" . web-mode)
   ("\\.tpl\\'" . web-mode)
   ("\\.[agj]sp\\'" . web-mode)
   ("\\.as[cp]x\\'" . web-mode)
   ("\\.erb\\'" . web-mode)
   ("\\.mustache\\'" . web-mode)
   ("\\.djhtml\\'" . web-mode)))

(use-package lsp-mode
  :hook ((java-mode . lsp))
  :commands lsp
  :config
  (setq lsp-prefer-flymake nil   ;; Use flycheck instead of flymake
        lsp-enable-snippet t
        lsp-completion-provider :capf))

(use-package lsp-ui
  :commands lsp-ui-mode
  :config
  (setq lsp-ui-doc-enable t
        lsp-ui-sideline-enable t
        lsp-ui-sideline-show-code-actions t))

(use-package lsp-treemacs
  :after lsp)

(use-package company
  :hook ((java-mode . company-mode))
  :config
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.0))

(use-package dap-mode
  :after lsp-mode
  :config
  (dap-auto-configure-mode)
  ;; Enable java debugging support
  (require 'dap-java))

;; LSP Java
(use-package lsp-java
  :after lsp
  :config
  (add-hook 'java-mode-hook #'lsp)
  ;; Optional: auto import
  (setq lsp-java-format-settings-url "https://raw.githubusercontent.com/google/styleguide/gh-pages/eclipse-java-google-style.xml"
        lsp-java-format-settings-profile "GoogleStyle"))

(use-package all-the-icons :if (display-graphic-p))

(use-package doom-themes
  :init
  (load-theme 'doom-one t))

(use-package doom-modeline
  :init
  (doom-modeline-mode 1)
  :custom
  ;; Optional tweaks
  (doom-modeline-height 25)
  (doom-modeline-bar-width 3)
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-minor-modes nil)
  (doom-modeline-indent-info t)
  (doom-modeline-icon t))  ;; requires all-the-icons package

(use-package multiple-cursors)

(use-package eyebrowse)
(eyebrowse-mode)
