readme.org
** JavaScript/TypeScript

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package jtsx
  :ensure t
  :mode (("\\.jsx?\\'" . jtsx-jsx-mode)
         ("\\.tsx\\'" . jtsx-tsx-mode)
         ("\\.ts\\'" . jtsx-typescript-mode))
  :commands jtsx-install-treesit-language
  :hook ((jtsx-jsx-mode . hs-minor-mode)
         (jtsx-tsx-mode . hs-minor-mode)
         (jtsx-typescript-mode . hs-minor-mode))
  :custom
  ;; Optional customizations
  (js-indent-level 4)
  ;; (typescript-ts-mode-indent-offset 2)
  ;; (jtsx-switch-indent-offset 0)
  ;; (jtsx-indent-statement-block-regarding-standalone-parent nil)
  ;; (jtsx-jsx-element-move-allow-step-out t)
  ;; (jtsx-enable-jsx-electric-closing-element t)
  ;; (jtsx-enable-electric-open-newline-between-jsx-element-tags t)
  ;; (jtsx-enable-jsx-element-tags-auto-sync nil)
  ;; (jtsx-enable-all-syntax-highlighting-features t)
  :config
  (defun jtsx-bind-keys-to-mode-map (mode-map)
    "Bind keys to MODE-MAP."
    (define-key mode-map (kbd "C-c C-j") 'jtsx-jump-jsx-element-tag-dwim)
    (define-key mode-map (kbd "C-c j o") 'jtsx-jump-jsx-opening-tag)
    (define-key mode-map (kbd "C-c j c") 'jtsx-jump-jsx-closing-tag)
    (define-key mode-map (kbd "C-c j r") 'jtsx-rename-jsx-element)
    (define-key mode-map (kbd "C-c <down>") 'jtsx-move-jsx-element-tag-forward)
    (define-key mode-map (kbd "C-c <up>") 'jtsx-move-jsx-element-tag-backward)
    (define-key mode-map (kbd "C-c C-<down>") 'jtsx-move-jsx-element-forward)
    (define-key mode-map (kbd "C-c C-<up>") 'jtsx-move-jsx-element-backward)
    (define-key mode-map (kbd "C-c C-S-<down>") 'jtsx-move-jsx-element-step-in-forward)
    (define-key mode-map (kbd "C-c C-S-<up>") 'jtsx-move-jsx-element-step-in-backward)
    (define-key mode-map (kbd "C-c j w") 'jtsx-wrap-in-jsx-element)
    (define-key mode-map (kbd "C-c j u") 'jtsx-unwrap-jsx)
    (define-key mode-map (kbd "C-c j d n") 'jtsx-delete-jsx-node)
    (define-key mode-map (kbd "C-c j d a") 'jtsx-delete-jsx-attribute)
    (define-key mode-map (kbd "C-c j t") 'jtsx-toggle-jsx-attributes-orientation)
    (define-key mode-map (kbd "C-c j h") 'jtsx-rearrange-jsx-attributes-horizontally)
    (define-key mode-map (kbd "C-c j v") 'jtsx-rearrange-jsx-attributes-vertically))
    
  (defun jtsx-bind-keys-to-jtsx-jsx-mode-map ()
      (jtsx-bind-keys-to-mode-map jtsx-jsx-mode-map))

  (defun jtsx-bind-keys-to-jtsx-tsx-mode-map ()
      (jtsx-bind-keys-to-mode-map jtsx-tsx-mode-map))

  (add-hook 'jtsx-jsx-mode-hook 'jtsx-bind-keys-to-jtsx-jsx-mode-map)
  (add-hook 'jtsx-tsx-mode-hook 'jtsx-bind-keys-to-jtsx-tsx-mode-map))
#+end_src

** Syntax Highlighting & Editing

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package rainbow-delimiters)
(use-package smartparens)
(use-package kdl-mode)
#+end_src

** File Management

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package diredfl
  :hook (dired-mode . diredfl-mode))
#+end_src

** Productivity & Utilities

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package wakatime-mode)
(global-wakatime-mode 1)
#+end_src

** Window Management

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package shackle)
(setq shackle-rules
      '((compilation-mode :align bottom :size 0.25 :select f)
        (grep-mode        :align bottom :size 0.25 :select f)
        (help-mode        :align right  :size 0.4 :select f)
        (Man-mode         :align right  :size 0.5 :select f)))
(shackle-mode 1)
(setq compilation-scroll-output 'first-error
      compilation-ask-about-save nil
      compilation-auto-jump-to-first-error t)
#+end_src

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/ui.el

(defun my/split-window-right-and-focus ()
  "Split the window vertically and move focus to the new one."
  (interactive)
  (split-window-right)
  (other-window 1))

(defun my/split-window-below-and-focus ()
  "Split the window vertically and move focus to the new one."
  (interactive)
  (split-window-below)
  (other-window 1))


#+end_src

** Enhanced Completion UI

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
;; adds a frame in the middle where we use vertico
(use-package posframe
  :ensure t)

(use-package vertico-posframe
  :after vertico posframe
  :ensure t
  :custom
  (vertico-posframe-width 120)
  (vertico-posframe-min-width 50)
  (vertico-posframe-parameters '((left-fringe . 8) (right-fringe . 8)))
  :init
  (vertico-posframe-mode 1))

(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))
#+end_src

** Additional Utilities

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package ace-window)
(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
(use-package all-the-icons)
(use-package all-the-icons-ibuffer)

;;(use-package eglot
;;  :ensure t
;;  :hook (java-mode . eglot-ensure)
;;  :config
;;  ;; point to the Eclipse JDT Language Server if needed
;;  (add-to-list 'eglot-server-programs
;;               '(java-mode . ("jdtls"))))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))

(use-package jetbrains-darcula-theme)
(use-package pyvenv)
(use-package fancy-compilation)
#+end_src

* Keybindings (lisp/keybindings.el)

All custom keybindings organized by category.

** Project & Navigation

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;; Treemacs
(global-set-key [f8] 'treemacs)
(global-set-key (kbd "C-c o p") 'treemacs)

;; Projectile
(projectile-mode +1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
#+end_src

** Code Folding

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;; fold this
(global-set-key (kbd "C-c C-f") 'fold-this-all)
(global-set-key (kbd "C-c C-F") 'fold-this)
(global-set-key (kbd "C-c M-f") 'fold-this-unfold-all)
#+end_src

** Multiple Cursors

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;; multiple cursor
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(define-key key-translation-map (kbd "M-S-d") (kbd "M-D"))
(global-set-key (kbd "M-D") 'mc/mark-next-like-this-word)
#+end_src

** Buffer Management

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
(global-set-key (kbd "C-x C-b") 'ibuffer)
(global-set-key (kbd "C-x 3") #'my/split-window-right-and-focus)
(global-set-key (kbd "C-x 2") #'my/split-window-below-and-focus)
#+end_src

** Compilation

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;;compile
(global-set-key (kbd "C-c c c") 'compile)
(global-set-key (kbd "C-c c C") 'recompile)
(global-set-key (kbd "C-c p c c") 'projectile-compile-project)
(global-set-key [f10] 'recompile)
#+end_src

Makes so the cursor doesnt go to compile buffre
#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/ui.el
(setq compilation-finish-functions
      (lambda (buf msg)
        (when (string-match ".*finished" msg)
          (message "Compilation finished successfully."))))

(setq display-buffer-alist
      '(("\\*compilation\\*"
         (display-buffer-reuse-window display-buffer-at-bottom)
         (window-height . 0.3)
         (inhibit-same-window . t))))
#+end_src

** Window Management

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;; ace-window
(global-set-key (kbd "C-x o") 'ace-window)
#+end_src

** LSP

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
;;lsp
(global-set-key (kbd "C-c c d") 'lsp-goto-type-definition)
#+end_src

** Org mode
#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
(keymap-set emacs-lisp-mode-map "C-c r" 'eval-buffer)
#+end_src

** Yassnipet
#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
(use-package yasnippet)
(yas-global-mode 1)
#+end_src
** Dired

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
(add-hook 'dired-mode-hook
          (lambda ()
            (define-key dired-mode-map [mouse-1] 'dired-find-alternate-file)))

(put 'dired-find-alternate-file 'disabled nil)

#+end_src

** ETC
#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/keybindings.el
(global-set-key (kbd "C-h l") 'load-theme)

(defun rc/duplicate-line ()
  "Duplicate current line"
  (interactive)
  (let ((column (- (point) (point-at-bol)))
        (line (let ((s (thing-at-point 'line t)))
                (if s (string-remove-suffix "\n" s) ""))))
    (move-end-of-line 1)
    (newline)
    (insert line)
    (move-beginning-of-line 1)
    (forward-char column)))


(global-set-key (kbd "C-.") 'rc/duplicate-line)
#+end_src

* UI Configuration (lisp/ui.el)

Visual and interface settings.

** Basic UI Settings
#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/packages.el
  (use-package mlscroll)
  (use-package good-scroll)
#+end_src

#+begin_src emacs-lisp :tangle ~/.config/emacs/lisp/ui.el
(setq inhibit-startup-message t  ; Don't show the splash screen
      visible-bell t)            ; Flash when the bell rings

;; Disable unnecessary UI elements
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(mlscroll-mode)
(good-scroll-mode)

(add-to-list 'default-frame-alist '(font . "Iosevka" ))
(set-face-attribute 'default t :font "Iosevka" :weight 'semi-bold )
#+end_src

